# EqPt

## Description
Returns TRUE if the 2D points are equal within the tolerance.

```pascal
FUNCTION EqPt(
				pt1       : VECTOR;
				pt2       : VECTOR;
				tolerance : REAL) : BOOLEAN;
```

```python

def vs.EqPt(pt1, pt2, tolerance):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt1|VECTOR||
|pt2|VECTOR||
|tolerance|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation